In [49]:
#import libraries
import pandas as pd
import numpy as np

In [50]:
df = pd.read_csv("/Users/ilseeb/Downloads/Train Punctuality Data/brussels_weather.csv")

In [51]:
df.head()

,location,Grand Place Brussels,Grand Place Brussels.1,Grand Place Brussels.2,Grand Place Brussels.3
0,lat,50.75000,50.75000,50.75000,50.75000
1,lon,4.25000,4.25000,4.25000,4.25000
2,asl,65.530,65.530,65.530,65.530
3,variable,Temperature,Relative Humidity,Wind Speed,Wind Direction
4,unit,째C,%,km/h,째

In [52]:
df.drop(df.index[:9], inplace=True)

In [53]:
df.head()

,location,Grand Place Brussels,Grand Place Brussels.1,Grand Place Brussels.2,Grand Place Brussels.3
9,20140101T0000,6.4709435,91.90476,20.774214,207.89728
10,20140101T0100,6.840944,91.48526,20.592503,216.46924
11,20140101T0200,6.7509437,91.160164,19.296135,216.65611
12,20140101T0300,6.360944,89.92542,19.164717,208.00919
13,20140101T0400,6.0409436,88.89181,19.255793,200.8068

In [54]:
df = df.rename(columns={"location": "date_time" ,"Grand Place Brussels": "temperature", "Grand Place Brussels.1": "relative_humidity", "Grand Place Brussels.2": "wind_speed", "Grand Place Brussels.3": "wind_direction"})

In [55]:
df["year"] = df["date_time"].apply(lambda x: x[:4])

In [56]:
df["month"] = df["date_time"].apply(lambda x: x[4:6])

In [57]:
df["day"] = df["date_time"].apply(lambda x: x[6:8])

In [58]:
df["time"] = df["date_time"].apply(lambda x: x[9:])

In [59]:
df.head()

,date_time,temperature,relative_humidity,wind_speed,wind_direction,year,month,day,time
9,20140101T0000,6.4709435,91.90476,20.774214,207.89728,2014,01,01,0000
10,20140101T0100,6.840944,91.48526,20.592503,216.46924,2014,01,01,0100
11,20140101T0200,6.7509437,91.160164,19.296135,216.65611,2014,01,01,0200
12,20140101T0300,6.360944,89.92542,19.164717,208.00919,2014,01,01,0300
13,20140101T0400,6.0409436,88.89181,19.255793,200.8068,2014,01,01,0400

In [60]:
df["time"] = df["time"].apply(lambda x: x[:2]).astype(float)

In [61]:
df.head()

,date_time,temperature,relative_humidity,wind_speed,wind_direction,year,month,day,time
9,20140101T0000,6.4709435,91.90476,20.774214,207.89728,2014,01,01,0.0
10,20140101T0100,6.840944,91.48526,20.592503,216.46924,2014,01,01,1.0
11,20140101T0200,6.7509437,91.160164,19.296135,216.65611,2014,01,01,2.0
12,20140101T0300,6.360944,89.92542,19.164717,208.00919,2014,01,01,3.0
13,20140101T0400,6.0409436,88.89181,19.255793,200.8068,2014,01,01,4.0

In [63]:
df.to_csv("/Users/ilseeb/Downloads/Train Punctuality Data/weather_data.csv")

In [65]:
df.dtypes

date_time             object
temperature           object
relative_humidity     object
wind_speed            object
wind_direction        object
year                  object
month                 object
day                   object
time                 float64
dtype: object